**Basic SQL- WEEK 1**

In [ ]:
1cf128005052714054f5192973366364
PYTHONsql2022!
1cf128005052714054f5192973366364

SELECT column1, column2 FROM TABLENAME ;

#THIS WILL SHOW ALL TABLE
SELECT * FROM TABLENAME;

#Conditionals
SELECT * FROM TABLENAME WHERE id>5;

#TEXT
SELECT * FROM TABLENAME WHERE dept='IT';
#Does not equal
SELECT * FROM TABLENAME WHERE dept<>'IT';

#Count
SELECT COUNT (*) FROM Tablename;

SELECT COUNT(Locations) FROM tablename WHERE Writer ="James Cameron";

#Distict.. To show with out duplicates
SELECT DISTINCT Title FROM tablename;

SELECT COUNT(DISTINCT ReleaseYear) FROM Tname WHERE ProductionCompany="Calaf":
#Limit.. Limited number of rows
SELECT * FROM Tname LIMIT 10;

#Retrieve the next 3 film names distinctly after first 5 films released in 2015.
SELECT DISTINCT Title FROM FilmLocations WHERE ReleaseYear=2015 LIMIT 3 OFFSET 5;

#INSERT INTO TALE
INSERT INTO TNAME (c1,c2,c3,c4)
VALUES(V1,V2..);

INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(5, 'Doe', 'John', 'Sydney', 'AU'), (6, 'Doe', 'Jane', 'Dhaka', 'BD');
#UPFATING TABLE
UPDATE TNAME
SET C1= V1,V2,V3
WHERE name="jj"l;

update Instructor
set city='Dhaka', country='BD'
where ins_id=4;
#DELETE
DELETE FROM Tname
WHERE condition ;

**W2- Creating Tables **

In [ ]:
create table TEST(
    ID integer,
    NAME varchar(30)
);

#Another one
create table COUNTRY(
    ID int not null,
    CCODE char(2),
    Name varchar(12),
    primary key(ID)
);

#Dropping tables

drop table COUNTRY;
create table COUNTRY(
    ID int primary key  not null,
    JOB  varchar(40),
    LOCATION  varchar(29)
)

#Alter statement is used to change, delete, or modify a table
alter table tname
add column HEUGHT int not null;

alter table tname
drop column HEIGHT;

alter table tname
rename column 'height'to 'Height'
#Remove all the crows instaed of removing entire table
truncate table COUNTRY;

Table creation and munipulation full

In [ ]:

CREATE TABLE PETSALE (
    ID INTEGER NOT NULL,
    PET CHAR(20),
    SALEPRICE DECIMAL(6,2),
    PROFIT DECIMAL(6,2),
    SALEDATE DATE
    );

CREATE TABLE PET (
    ID INTEGER NOT NULL,
    ANIMAL VARCHAR(20),
    QUANTITY INTEGER
    );

insert into petsale values
	(1,'pig',100.6,200,'2022.9.10'),
	(2,'dog',100.6,200,'2022.9.10'),
	(3,'iraq',100.6,200,'2022.9.10'),
	(4,'bird',100.6,200,'2022.9.10');

insert into PET values
	(1,'nouse',100),
	(2,'birds',400),
	(3,'lion',23);

select * from PETSALE;
select * from PET;

alter table PETSALE
add column QUANTITY integer;

select * from PETSALE;

update petsale  set QUANTITY =19 where ID =1;
update petsale  set QUANTITY =15 where ID =2;
update petsale  set QUANTITY =17 where ID =3;
update petsale  set QUANTITY =90 where ID =4;
update petsale  set QUANTITY =10 where ID =5;

select * from PETSALE;

alter table PETSALE
drop column PROFIT;

select * from PETSALE;

alter table PETSALE
alter column PET set data type varchar(20);

select * from PETSALE;

alter table PETSALE
rename column PET to ANIMAL;
select * from PETSALE;


truncate table PET immediate;

select * from PET;


drop table PET;
select * from PET;

Sorting, Grouping, and Joins


---

In [ ]:
#Retrieve all employees whose address is in Elgin,IL.
SELECT F_NAME , L_NAME
FROM EMPLOYEES
WHERE ADDRESS LIKE '%Elgin,IL%';

#Retrieve all employees who were born during the 1970's.
SELECT F_NAME , L_NAME
FROM EMPLOYEES
WHERE B_DATE LIKE '197%';

#Retrieve all employees in department 5 whose salary is between 60000 and 70000.

SELECT *
FROM EMPLOYEES
WHERE (SALARY BETWEEN 60000 AND 70000) AND DEP_ID = 5;

#SORTING

#Retrieve a list of employees ordered by department ID.
SELECT F_NAME, L_NAME, DEP_ID
FROM EMPLOYEES
ORDER BY DEP_ID;

#Retrieve a list of employees ordered in descending order by department ID and within each department ordered alphabetically in descending order by last name.
SELECT F_NAME, L_NAME, DEP_ID
FROM EMPLOYEES
ORDER BY DEP_ID DESC, L_NAME DESC;

#Retrieve a list of employees ordered by department name, and within each department ordered alphabetically in descending order by last name.
SELECT D.DEP_NAME , E.F_NAME, E.L_NAME
FROM EMPLOYEES as E, DEPARTMENTS as D
WHERE E.DEP_ID = D.DEPT_ID_DEP
ORDER BY D.DEP_NAME, E.L_NAME DESC;

In [ ]:
#Grouping

#For each department ID retrieve the number of employees in the department.
SELECT DEP_ID, COUNT(*)
FROM EMPLOYEES
GROUP BY DEP_ID;

#For each department retrieve the number of employees in the department, and the average employee salary in the department..
SELECT DEP_ID, COUNT(*), AVG(SALARY)
FROM EMPLOYEES
GROUP BY DEP_ID;

#Label the computed columns in the result set of SQL problem 2 (Exercise 3 Problem 2) as NUM_EMPLOYEES and AVG_SALARY.
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID;

#In SQL problem 3 (Exercise 3 Problem 3), order the result set by Average Salary..
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID
ORDER BY AVG_SALARY;

#Limit with count of 4
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID
HAVING count(*) < 4
ORDER BY AVG_SALARY;

Built in Functionas


---

In [ ]:
#Aggregate Function
Query A1: Enter a function that calculates the total cost of all animal rescues in the PETRESCUE table.

select SUM(COST) from PETRESCUE;
select SUM(COST) AS SUM_OF_COST from PETRESCUE;
select MAX(QUANTITY) from PETRESCUE;
select AVG(QUANTITY) from PETRESCUE;
select AVG(COST/QUANTITY) from PETRESCUE where ANIMAL = 'Dog';


#String and Numbers Patterns Functions
Query B1: Enter a function that displays the rounded cost of each rescue.

select ROUND(COST) from PETRESCUE;

Query B2: Enter a function that displays the length of each animal name.

select LENGTH(ANIMAL) from PETRESCUE;

Query B3: Enter a function that displays the animal name in each rescue in uppercase.

select UCASE(ANIMAL) from PETRESCUE;

Query B4: Enter a function that displays the animal name in each rescue in uppercase without duplications.

select DISTINCT(UCASE(ANIMAL)) from PETRESCUE;

Query B5: Enter a query that displays all the columns from the PETRESCUE table, where the animal(s) rescued are cats. Use cat in lower case in the query.

select * from PETRESCUE where LCASE(ANIMAL) = 'cat';


#Date and Time Functions

Query C1: Enter a function that displays the day of the month when cats have been rescued.

select DAY(RESCUEDATE) from PETRESCUE where ANIMAL = 'Cat';

Query C2: Enter a function that displays the number of rescues on the 5th month.

select SUM(QUANTITY) from PETRESCUE where MONTH(RESCUEDATE)='05';

Query C3: Enter a function that displays the number of rescues on the 14th day of the month.

select SUM(QUANTITY) from PETRESCUE where DAY(RESCUEDATE)='14';

Query C4: Animals rescued should see the vet within three days of arrivals. Enter a function that displays the third day from each rescue.

select (RESCUEDATE + 3 DAYS) from PETRESCUE;

Query C5: Enter a function that displays the length of time the animals have been rescued; the difference between today’s date and the recue date.

select (CURRENT DATE - RESCUEDATE) from PETRESCUE;

Sub Queries and Multiple Tables

In [ ]:
#Execute a working query using a sub-select to retrieve all employees records whose salary is lower than the average salary.
select EMP_ID, F_NAME, L_NAME, SALARY
from employees
where SALARY < (select AVG(SALARY)
                from employees);

#Execute a Column Expression that retrieves all employees records with EMP_ID, SALARY and maximum salary as MAX_SALARY in every row.
select EMP_ID, SALARY, ( select MAX(SALARY) from employees ) AS MAX_SALARY
from employees;

#Execute a Table Expression for the EMPLOYEES table that excludes columns with sensitive employee data (i.e. does not include columns: SSN, B_DATE, SEX, ADDRESS, SALARY).
select * from ( select EMP_ID, F_NAME, L_NAME, DEP_ID from employees) AS EMP4ALL;


#Multiple Tables
#Retrieve only the EMPLOYEES records that correspond to jobs in the JOBS table.
select * from employees where JOB_ID IN (select JOB_IDENT from jobs);

#Retrieve only the list of employees whose JOB_TITLE is Jr. Designer.
select * from employees where JOB_ID IN (select JOB_IDENT from jobs where JOB_TITLE= 'Jr. Designer');

#Retrieve JOB information and who earn more than $70,000.
select JOB_TITLE, MIN_SALARY,MAX_SALARY,JOB_IDENT from jobs where JOB_IDENT IN (select JOB_ID from employees where SALARY > 70000 );
#Retrieve JOB information and whose birth year is after 1976.
select JOB_TITLE, MIN_SALARY,MAX_SALARY,JOB_IDENT from jobs where JOB_IDENT IN (select JOB_ID from employees where YEAR(B_DATE)>1976 );
#Retrieve JOB information for female employees whose birth year is after 1976.
select JOB_TITLE, MIN_SALARY,MAX_SALARY,JOB_IDENT from jobs where JOB_IDENT IN (select JOB_ID from employees where YEAR(B_DATE)>1976 and SEX='F' );

#Perform an implicit cartesian/cross join between EMPLOYEES and JOBS tables.
select * from employees, jobs;

#Retrieve only the EMPLOYEES records that correspond to jobs in the JOBS table.
select * from employees, jobs where employees.JOB_ID = jobs.JOB_IDENT;
#Redo the previous query, but retrieve only the Employee ID, Employee Name and Job Title.
select EMP_ID,F_NAME,L_NAME, JOB_TITLE from employees E, jobs J where E.JOB_ID = J.JOB_IDENT;

#Redo the previous query, but specify the fully qualified column names with aliases in the SELECT clause.
select E.EMP_ID,E.F_NAME,E.L_NAME, J.JOB_TITLE from employees E, jobs J where E.JOB_ID = J.JOB_IDENT;

In [ ]:
pip install sqllite